---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandleNameData.Dispose
source: html/c78be063-42de-d100-2a73-a2a3583d81c4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleNameData.Dispose Method

Releases all resources used by the RebarHandleNameData

## Syntax (C#)
```csharp
public void Dispose()
```